controllers/AuthorsController.php

SELECT * FROM `authors` WHERE `idauthors`='1'
---
    protected function findModel($idauthors)
    {
        if (($model = Authors::findOne(['idauthors' => $idauthors])) !== null) {