controllers/BooksController.php

    protected function findModel($idbooks)
    {
        if (($model = Books::findOne(['idbooks' => $idbooks])) !== null) {
---
SELECT * FROM `books` WHERE `idbooks`='1'